package spanthera;

import java.util.ArrayList;
import java.util.List;

/**
 * Created by omishali on 10/09/2017.
 */
public class PsukimTagger implements SpanTagger {
    private String[] psukim = {"וקוץ ודרדר תצמיח לך ואכלת את עשב השדה",
            "וייצר יהוה אלהים את האדם עפר מן האדמה ויפח באפיו נשמת חיים ויהי האדם לנפש חיה",
            "ויהוה אלהים אמת הוא אלהים חיים ומלך עולם מקצפו תרעש הארץ ולא יכלו גוים זעמו",
            "ויאמר אלהים אל משה אהיה אשר אהיה ויאמר כה תאמר לבני ישראל אהיה שלחני אליכם",
            "דעו כי יהוה הוא אלהים הוא עשנו (ולא) ולו אנחנו עמו וצאן מרעיתו",
            "ויאמר יהוה אלהי אבתינו הלא אתה הוא אלהים בשמים ואתה מושל בכל ממלכות הגוים ובידך כח וגבורה ואין עמך להתיצב",
            "ונשמע וימס לבבנו ולא קמה עוד רוח באיש מפניכם כי יהוה אלהיכם הוא אלהים בשמים ממעל ועל הארץ מתחת",
            "ויאמר לגיחזי חגר מתניך וקח משענתי בידך ולך כי תמצא איש לא תברכנו וכי יברכך איש לא תעננו ושמת משענתי על פני הנער",
            "ויען שכניה בן יחיאל מבני (עולם) עילם ויאמר לעזרא אנחנו מעלנו באלהינו ונשב נשים נכריות מעמי הארץ ועתה יש מקוה לישראל על זאת",
            "והשנית למי אני אעבד הלוא לפני בנו כאשר עבדתי לפני אביך כן אהיה לפניך",
            "ותאמר נעמי לכלתה ברוך הוא ליהוה אשר לא עזב חסדו את החיים ואת המתים ותאמר לה נעמי קרוב לנו האיש מגאלנו הוא",
            "ויאמר אלהים אל בלעם לא תלך עמהם לא תאר את העם כי ברוך הוא",
            "ומשא יהוה לא תזכרו עוד כי המשא יהיה לאיש דברו והפכתם את דברי אלהים חיים יהוה צבאות אלהינו",
            "כי מי כל בשר אשר שמע קול אלהים חיים מדבר מתוך האש כמנו ויחי",
            "ויאמר דוד אל האנשים העמדים עמו לאמר מה יעשה לאיש אשר יכה את הפלשתי הלז והסיר חרפה מעל ישראל כי מי הפלשתי הערל הזה כי חרף מערכות אלהים חיים",
            "גם את הארי גם הדוב הכה עבדך והיה הפלשתי הערל הזה כאחד מהם כי חרף מערכת אלהים חיים"
    };
    private String[] uris = {"jbr:tanach-1-3-18", "jbr:tanach-1-2-7", "jbr:tanach-13-10-10", "jbr:tanach-2-3-14",
    "jbr:tanach-27-100-3", "jbr:tanach-39-20-6", "jbr:tanach-6-2-11", "jbr:tanach-11-4-29", "jbr:tanach-36-10-2",
    "jbr:tanach-9-16-19", "jbr:tanach-31-2-20", "jbr:tanach-4-22-12", "jbr:tanach-13-23-36", "jbr:tanach-5-5-25",
            "jbr:tanach-8-17-26", "jbr:tanach-8-17-36"};


    public List<String> tag(Span s) {
        List<String> result = new ArrayList<>();
        for (int i=0; i<psukim.length; i++)
            if (psukim[i].contains(format(s.text())))
                result.add(uris[i]);

        return result;
    }
    public boolean isCandidate(Span s) {
        return s.size() == 2;
    }

    private String format(String s) {
        String result = s.replace("\"", "").
                replace(";", "").
                replace(".", "").
                replace(",", "").
                replace(":", "").
                replace("ויי ", "ויהוה ");

        //System.out.println(result);
        return result;
    }
}