{
  "subjects": [
    {
      "jbo:within": [
        "jbr:section-mishnetorah-2",
        "jbr:section-mishnetorah-2-1-1"
      ],
      "uri": "jbr:text-mishnetorah-kesefmishne-2-1-1-1",
      "jbo:position": "1",
      "jbo:text": "כסף משנה  פעמים בכל וכו'. מפורש פרק קמא דברכות (דף י\"א.) דבין לבית שמאי בין לבית הלל פעמים ביום קוראים את שמע אלא שנחלקו היאך קוראין אותה וז''ל %ב''ש אומרים בערב כל אדם יטו ויקראו ובבקר יעמדו שנאמר בשכבך ובקומך וב''ה אומרים כל אדם קורין כדרכן שנאמר ובלכתך בדרך א''כ למה נאמר בשכבך ובקומך בשעה שדרך בני אדם שוכבים ובשעה שבני אדם עומדים.% ורבינו נקט לישנא דב''ה והקדים ק''ש של לילה כלישנא דקרא של לילה ברישא וטעמא דקרא משום דתחלת היום מן הלילה הוא כדכתיב ויהי ערב וכו':",
      "jbo:interprets": "jbr:text-mishnetorah-2-1-1-1",
      "jbo:book": "jbr:book-kesefmishne",
      "rdfs:label": "כסף משנה הלכות קריאת שמע א א"
    },
    {
      "jbo:within": [
        "jbr:section-mishnetorah-2",
        "jbr:section-mishnetorah-2-1-1"
      ],
      "uri": "jbr:text-mishnetorah-lechemmishne-2-1-1-1",
      "jbo:position": "2",
      "jbo:text": "לחם משנה  פעמים בכל יום וכו'. משנה פרק קמא דברכות (דף י\"א:) %ב''ש אומרים בערב כל אדם יטה ויקרא וכו' וב''ה אומרים כל אדם% וכו' והלכה כב''ה:",
      "jbo:interprets": "jbr:text-mishnetorah-2-1-1-1",
      "jbo:book": "jbr:book-lechemmishne",
      "rdfs:label": "לחם משנה הלכות קריאת שמע א א"
    },
    {
      "jbo:within": [
        "jbr:section-mishnetorah-2",
        "jbr:section-mishnetorah-2-1-1"
      ],
      "uri": "jbr:text-mishnetorah-kesefmishne-2-1-1-2",
      "jbo:position": "3",
      "jbo:text": "כסף משנה  ומה הוא קורא וכו'. כך מתבאר מתוך המשנה שאכתוב בסמוך: ומקדימין לקרות וכו'. פ''ב דברכות (דף י\"ג.) %אמר ריב''ק למה קדמה פרשת שמע לוהיה כדי שיקבל עליו עול מלכות שמים תחלה ואחר כך יקבל עליו עול מצות והיה אם שמוע לויאמר שוהיה אם שמוע נוהג בין ביום בין בלילה ויאמר אינו נוהג אלא ביום כלומר דמשתעי בציצית שאינה נוהגת אלא ביום.% ודע שגירסת רבינו הנכונה ואחריה והיה אם שמוע שיש בה צווי על שאר המצות וכך מצאתי בספר מדוייק ולא כמו שכתוב בספרינו שיש בה צווי על זכירת כל המצות דהא ליתא שעל המעשה צוה בוהיה אם שמוע לא על הזכירה בלבד וזה טעם רבינו בקדימת והיה אם שמוע לויאמר שוהיה אם שמוע יש בה צווי על המעשה ויאמר אין בה צווי על מעשה כל המצות אלא על זכירתן וראוי להקדים הצווי על המעשה לצווי על הזכירה ופירוש המשנה לדעת רבינו כך היא למה קדמה והיה אם שמוע לויאמר לפי שמעשה המצות שנזכר בוהיה אם שמוע נוהג בין ביום בין בלילה וזכירת המצות שעל ידי ציצית שנזכר בויאמר אינו נוהג אלא ביום רצוני המזכיר שהוא הציצית אינו אלא ביום וא''כ ראוי להקדים והיה אם שמוע לויאמר ורבינו רצה לתת לנו טעם למה אנו קוראים פרשת ציצית ואגב גררא נתן לנו טעם למה נתאחרה. וא''ת למה לי טעם שיש בה צווי זכירת המצות תיפוק ליה משום שיש בה זכירת יציאת מצרים ומצוה להזכיר יציאת מצרים ביום ובלילה י''ל שאילו לא היינו קורין אותה אלא מטעם יציאת מצרים לא היינו מצרפים אותה עם שמע והיה אם שמוע שאינה מענינם אבל לפי שיש בה ציווי זכירת כל המצות נצטרפה עם פרשיות אלו וכיון שנצטרפה להם בקריאת היום אע''פ שמצות ציצית אינה נוהגת אלא ביום לא ראו חכמים לחלק בין יום ולילה:",
      "jbo:interprets": "jbr:text-mishnetorah-2-1-1-2",
      "jbo:book": "jbr:book-kesefmishne",
      "rdfs:label": "כסף משנה הלכות קריאת שמע א ב"
    },
    {
      "jbo:within": [
        "jbr:section-mishnetorah-2",
        "jbr:section-mishnetorah-2-1-1"
      ],
      "uri": "jbr:text-mishnetorah-lechemmishne-2-1-1-2",
      "jbo:position": "4",
      "jbo:text": "לחם משנה  ומה הוא קורא וכו'. ריש פרק ב' דברכות (דף י\"ג:) %היה קורא בתורה וכו' אמר רבי יהושע בן קרחה למה קדמה% וכו' (ועיין בכסף משנה) ובגמרא (דף י\"ד ע\"ב) בברייתא נתנו טעם אחר לקדימת והיה אם שמוע לויאמר %שזה יש בו ללמוד ולעשות ויאמר אין בו אלא לעשות% ע''כ. ורבינו לא כתב א' מאלו הטעמים וא''כ יש לתמוה עליו כיון שכוונתו לתת טעם לקדימתן זה לזה כמו שנראה מתחילת לשונו שכתב ומקדימין לקרות וכו' משמע שבא לתת טעם לקדימתה וא''כ היה לו לתת טעם לקדימת והיה אם שמוע לויאמר א' מן הטעמים האמורים בגמרא וקשה עוד מזה שהטעם שנותן הוא אינו טעם כלל שהרי כתב ואח''כ פ' ציצית שגם היא יש בה צווי וכו' ואין זה טעם לאיחורה לוהיה אם שמוע שוהיה אם שמוע נמי אין בה אלא צווי זכירת כל המצות כמ''ש ואחריה והיה אם שמוע שיש בה צווי וכו'. ונראה לתרץ שלא רצה רבינו לתת טעם לקדימת והיה אם שמוע לויאמר שזו אינה קושיא כלל שהרי בתורה כתובה פרשת והיה אם שמוע אחר פרשת שמע ושמע אחר ויאמר וא''כ אם נקדים ויאמר לוהיה אם שמוע אין כאן שום סדר מהכתוב בתורה אבל עתה יש קצת סדר שהרי והיה אם שמוע היא אחר שמע ככתוב בתורה בלי שום הפסק ויאמר ביניהם. אבל הקושיא שהיה ראוי להקדים ויאמר לשמע מפני שכך כתובה בתורה וכדכתבו התוספות. לזה תירץ שטעם קדימת שמע מפני שיש בה יחוד ה'. וכיון שנתן טעם לקדימתה אין צורך לתת טעם לאיחור פרשת ויאמר שבדין נתאחרה כדי לשמור קצת סדר הכתוב בתורה שהוא והיה אם שמוע ולא נפסיק ביניהם כלל וכדכתיבנא. ומ''ש ואח''כ פרשת ציצית שגם היא וכו' הכוונה לתת טעם למה אנו קוראים זאת הפרשה אם מפני שיש בה יציאת מצרים הרי יש פרשה אחרת בתורה שהוזכר בה יציאת מצרים בפירוש שהרי לא הוזכר כאן יציאת מצרים אלא אגב גררא לזה אמר שאין זה הטעם לבד מספיק אלא הטעם הוא מפני שיש בה זכירת כל המצות:",
      "jbo:interprets": "jbr:text-mishnetorah-2-1-1-2",
      "jbo:book": "jbr:book-lechemmishne",
      "rdfs:label": "לחם משנה הלכות קריאת שמע א ב"
    },
    {
      "jbo:within": [
        "jbr:section-mishnetorah-2",
        "jbr:section-mishnetorah-2-1-1"
      ],
      "uri": "jbr:text-mishnetorah-kesefmishne-2-1-1-3",
      "jbo:position": "5",
      "jbo:text": "כסף משנה  אף ע''פ שאין מצות ציצית וכו'. כלומר כיון שזכירת המצות הכתוב בויאמר תלאו הכתוב בציצית והציצית אינו נוהג אלא ביום דין הוא שלא נקרא אותה בלילה אלא מפני שיש בה זכירת יציאת מצרים ומצוה להזכיר יציאת מצרים ביום ובלילה דאע''ג דעיקר גאולה ביום היתה מ''מ כי אתחלא גאולה בלילה אתחלא כדכתיב ויקרא פרעה למשה ואהרן לילה. והדין משנה סוף פרק קמא דברכות (דף י\"ב ע\"ב) %מזכירין יציאת מצרים בלילות שנאמר למען תזכור את יום צאתך מארץ מצרים כל ימי חייך ימי חייך הימים כל ימי חייך הלילות:%",
      "jbo:interprets": "jbr:text-mishnetorah-2-1-1-3",
      "jbo:book": "jbr:book-kesefmishne",
      "rdfs:label": "כסף משנה הלכות קריאת שמע א ג"
    },
    {
      "jbo:within": [
        "jbr:section-mishnetorah-2",
        "jbr:section-mishnetorah-2-1-1"
      ],
      "uri": "jbr:text-mishnetorah-lechemmishne-2-1-1-3",
      "jbo:position": "6",
      "jbo:text": "לחם משנה  אע''פ שאין מצות ציצית וכו'. וא''ת מה בכך מ''מ ראוי לאומרה בלילה מפני שיש בה ציווי זכירת כל המצות וי''ל כיון שאין הזכירה באה אלא ע''י ציצית כמש''ה וראיתם אותו וזכרתם וציצית אינו נוהג בלילה לא היה ראוי להזכירה אלא מפני שיש בה יציאת מצרים שמזכירין אותה אפילו בלילות לכך מזכירין אותה בלילות שנאמר %למען תזכור את יום צאתך מארץ מצרים כל ימי חייך% כדאיתא סוף פ''ק (דף י\"ב:) בבן זומא דאמר %למען תזכור [את יום צאתך מארץ מצרים] כל ימי חייך ימי חייך הימים כל ימי חייך הלילות:%",
      "jbo:interprets": "jbr:text-mishnetorah-2-1-1-3",
      "jbo:book": "jbr:book-lechemmishne",
      "rdfs:label": "לחם משנה הלכות קריאת שמע א ג"
    },
    {
      "jbo:within": [
        "jbr:section-mishnetorah-2",
        "jbr:section-mishnetorah-2-1-1"
      ],
      "uri": "jbr:text-mishnetorah-kesefmishne-2-1-1-4",
      "jbo:position": "7",
      "jbo:text": "כסף משנה  הקורא קריאת שמע כשהוא גומר וכו'. בפסחים (דף נ\"ו.) פרק מקום שנהגו %אמר רשב''ל ויקרא יעקב לבניו בקש יעקב לגלות לבניו קץ הימין ונסתלקה ממנו שכינה אמר שמא ח''ו יש במטתי פסול כאברהם שיצא ממנו ישמעאל ואבי יצחק שיצא ממנו עשו אמרו לו בניו שמע ישראל ה' אלהינו ה' אחד כשם שאין בלבך אלא אחד כך אין בלבבנו אלא אחד באותה שעה פתח יעקב אבינו ואמר ברוך שם כבוד מלכותו לעולם ועד. אמרי רבנן היכי נעביד נימריה לא אמריה משה רבינו לא נימריה הא אמריה יעקב התקינו שיהיו אומרים אותו בחשאי.% ורבינו לא נתן טעם למה אומרים אותו בלחש דברור הוא הטעם כדי להבדיל בינו למה שכתוב בתורה ולא בא אלא לתת טעם למה אומרים אותו ואין לדקדק מכאן שקורין ק''ש בקול רם כיון שהוצרכו לומר שקורין אותו בחשאי דאפשר לומר שהוצרכו לומר כן כדי להבדילו מפסוק שמע ישראל שאומרים אותו בקול רם אבל שאר ק''ש לעולם אימא לך שקורין בלחש א''נ דבק''ש ליכא קפידא אם קורא אותה בלחש או בקול רם אבל בשכמל''ו קפידא איכא שלא לקרותו אלא בחשאי. ומכל מקום יש לדקדק בלשון רבינו שכתב שבשעה שקבץ יעקב וכו' ציום וזרזם על יחוד השם וכו' וזה לא מצינו שהוזכר בגמרא אלא שביקש לגלות קץ הימין. וי''ל שרבינו לא רצה לכתוב שביקש לגלות את הקץ לבניו ונסתלקה ממנו שכינה לפי שאינו מענינו והוא ז''ל סובר שכשהזכירו בגמרא אמר שמא ח''ו יש במטתי פסול היינו שהזהירם על יחוד השם מכאן ואילך דאילו לשעבר יודע הוא שבניו כולם צדיקים במעשיהם אבל היה חושב שמא בלב אחד מהם יש איזה שורש פורה ראש ולענה וז''ש רבינו כענין שאמר משה שמשה רבינו ע''ה לא חשדם עכשיו במעשיהם אלא שיש בלבם טינא וזהו בעצמו ענין יעקב כנ''ל ליישב דברי רבינו. ומצאתי בספרי על פסוק שמע ישראל כשנפטר יעקב אבינו מן העולם קרא לבניו והוכיחם כל אחד בפני עצמו וחזר וקרא כולם כאחד אמר להם שמא בלבבכם מחלוקת על מי שאמר והיה העולם אמרו לו שמענו כשם שאין בלבך מחלוקת כך אין בלבנו מחלוקת על מי שאמר והיה העולם:",
      "jbo:interprets": "jbr:text-mishnetorah-2-1-1-4",
      "jbo:book": "jbr:book-kesefmishne",
      "rdfs:label": "כסף משנה הלכות קריאת שמע א ד"
    },
    {
      "jbo:within": [
        "jbr:section-mishnetorah-2",
        "jbr:section-mishnetorah-2-1-1"
      ],
      "uri": "jbr:text-mishnetorah-lechemmishne-2-1-1-4",
      "jbo:position": "8",
      "jbo:text": "לחם משנה  ולמה קורין וכו'. בפסחים פרק מקום שנהגו (דף נ\"ו) ושם אמרו %שהטעם שאנו אומרים אותו בלחש מפני שלא אמרו משה:%",
      "jbo:interprets": "jbr:text-mishnetorah-2-1-1-4",
      "jbo:book": "jbr:book-lechemmishne",
      "rdfs:label": "לחם משנה הלכות קריאת שמע א ד"
    },
    {
      "jbo:within": [
        "jbr:section-mishnetorah-2",
        "jbr:section-mishnetorah-2-1-1"
      ],
      "uri": "jbr:text-mishnetorah-lechemmishne-2-1-1-5",
      "jbo:position": "9",
      "jbo:text": "לחם משנה  הקורא קריאת שמע. משנה בפרק קמא דברכות (דף י\"א) %בשחר מברך שתים% וכו':",
      "jbo:interprets": "jbr:text-mishnetorah-2-1-1-5",
      "jbo:book": "jbr:book-lechemmishne",
      "rdfs:label": "לחם משנה הלכות קריאת שמע א ה"
    },
    {
      "jbo:within": [
        "jbr:section-mishnetorah-2",
        "jbr:section-mishnetorah-2-1-1"
      ],
      "uri": "jbr:text-mishnetorah-kesefmishne-2-1-1-6",
      "jbo:position": "10",
      "jbo:text": "כסף משנה  (ה-ו) הקורא קריאת שמע מברך וכו'. משנה פ''ק דברכות (דף י\"א.) %בשחר מברך שתים לפניה ואחת לאחריה ובערב מברך שתים לפניה ושתים לאחריה ותניא אין אומרים אהבת עולם אלא אהבה רבה ורבנן אמרי אהבת עולם% ופסקו הרי''ף והרא''ש כרבנן וזה דעת רבינו:",
      "jbo:interprets": "jbr:text-mishnetorah-2-1-1-6",
      "jbo:book": "jbr:book-kesefmishne",
      "rdfs:label": "כסף משנה הלכות קריאת שמע א ו"
    },
    {
      "jbo:within": [
        "jbr:section-mishnetorah-2",
        "jbr:section-mishnetorah-2-1-1"
      ],
      "uri": "jbr:text-mishnetorah-lechemmishne-2-1-1-6",
      "jbo:position": "11",
      "jbo:text": "לחם משנה  וברכה שנייה אהבת עולם וכו'. שם (דף י\"א ע\"ב) %אמר רב יהודה אמר שמואל אהבה רבה וכן וכו' ורבנן אמרי אהבת עולם וכן הוא אומר וכו' תניא נמי הכי אין אומרים אהבה רבה אלא אהבת עולם% ע''כ כך היא גירסת הרי''ף ז''ל בהלכות ונראה שזו ג''כ גירסת רבינו ז''ל ואתי שפיר דפסק כרבנן אבל גרסתנו בגמרא היא %תניא נמי הכי אין אומרים אהבת עולם אלא אהבה רבה% עד כאן ואתי סייעתא לדאמר רב יהודה אמר שמואל ולפי זה היה ראוי לפסוק כשמואל:",
      "jbo:interprets": "jbr:text-mishnetorah-2-1-1-6",
      "jbo:book": "jbr:book-lechemmishne",
      "rdfs:label": "לחם משנה הלכות קריאת שמע א ו"
    },
    {
      "jbo:within": [
        "jbr:section-mishnetorah-2",
        "jbr:section-mishnetorah-2-1-1"
      ],
      "uri": "jbr:text-mishnetorah-kesefmishne-2-1-1-7",
      "jbo:position": "12",
      "jbo:text": "כסף משנה  ברכות אלו וכו'. בפ' אין עומדין (ברכות ל\"ג.): %מקום שהתקינו לחתום% וכו'. משנה סוף פ''ק דברכות (דף י\"א.) %מקום שאמרו להאריך אינו רשאי לקצר לקצר אינו רשאי להאריך לחתום אינו רשאי שלא לחתום שלא לחתום אינו רשאי לחתום% ובירושלמי א''ר יודן מטבע קצר פותח בברוך ואינו חותם בברוך מטבע ארוך פותח וחותם בברוך ובתוספתא דברכות פ''ק מקום שאמרו להאריך אינו רשאי לקצר לקצר אינו רשאי להאריך לחתום אינו רשאי שלא לחתום שלא לחתום אינו רשאי לחתום לפתוח בברוך אינו רשאי שלא לפתוח שלא לפתוח אינו רשאי לפתוח וכך הוא לשון רבינו. וכתב רבינו בפירוש המשנה שנקראת ברכת יוצר ארוכה ואהבת עולם קצרה לפי שכל ברכה שיש בתחלתה ברוך ובסופה ברוך נקראת ארוכה ושאינו כן נקראת קצרה וא''כ פירוש המשנה לדעת רבינו מקום שאמרו להאריך כלומר להתחיל ולחתום בה בברוך אינו רשאי לקצר כלומר שלא להתחיל או שלא לחתום מקום שאמרו לקצר כלומר שלא להתחיל בברוך או שלא לחתום אינו רשאי להאריך כלומר להתחיל בברוך או לחתום: כתב הרמ''ך כל המשנה ממטבע וכו' וחוזר ומברך. ולא נהירא מההוא עובדא דההוא (תנא) דאמר בריך רחמנא מריה דהאי פיתא וגם מההוא דאמר דיהבך לן ולא יהבך לעפרא ופטרו אותו מלהודות אע''פ ששינה ממטבע בברכת הגומל ומנימין שינה ממטבע ברכת הזן ואעפ''כ יצא עכ''ל: וכל שאינו אומר אמת ויציב וכו'. שם [י''ב.] מימרא דרבה בר חנינא סבא משמיה דרב ופירש''י דבשחרית אומר אמת ויציב על החסד שעשה עם אבותינו שהוציאם ממצרים ובקע להם הים וברכת אמת ואמונה מדבר על הגאולה העתידה שאנו מצפים שיקיים לנו הבטחתו ואמונתו לגאלנו מיד מלכים ועריצים ולשום נפשנו בחיים ולהדריכנו על במות אויבינו עכ''ל. ואע''פ שכבר הזכרנו יציאת מצרים בפרשת ציצית חוזרים ואומרים אמת ויציב לומר שכשם שהקב''ה האמית הבטחתו במצרים כן יאמית לעתיד לבא וא''כ אמת ויציב נקשר עם אמת ואמונה ואף ע''פ שאמת ואמונה נתקן על גאולה העתידה אנו אומרים בסוף הברכה גאולה דפרעה כדי לסמוך לגאל ישראל: וכתבו ההגהות בשם הרמ''ך דלא יצא י''ח היינו שלא יצא ידי חובת ברכה זו אבל ידי חובת ק''ש יצא אפילו לא אמר הברכות כלל כדלקמן בפ''ב עכ''ל. ואני אומר שא''כ פשיטא הוא שמי שלא אמר אותה ברכה לא יצא י''ח אותה ברכה לכך י''ל דכיון דברכות אלו שאנו מאמינים שכשם שעשה בגאולת מצרים כן יעשה בגאולה העתידה מעין ק''ש הם ואם לא אמרם נהי דידי ק''ש יצא ידי ק''ש כראוי לא יצא. א''נ ה''ק אפילו אמר הברכות האלו אלא שלא התחיל אמת ויציב אמת ואמונה לא יצא י''ח קריאת ברכות אלו כראוי לפי שעיקרם נתקנו לומר שהקב''ה האמית הבטחתו במצרים ועתיד לאמתה לנו לעתיד לבא. וכתב ה''ר מנוח אית דפרשי שהפך הדבר שאומר אמת ואמונה בשחרית ואמת ויציב בערבית ונמצא משנה מטבע של חכמים ומשום הכי לא יצא ידי חובתו. ועוד שהוא צריך להזכיר אמונה בערב שאנו מפקידים רוחנו לידו של הקב''ה ובחסדו מחזירה לנו והיינו דכתיב להגיד בבקר חסדך וכו'. וכתב ה''ר אשר דכי אמרינן לא יצא דוקא כי אמר אני ה' אלהיכם אבל לא אמר אני ה' אלהיכם אין צריך לומר אמת כדאמרינן בגמרא [דף י''ד] לא אמר אני ה' אלהיכם אין צריך לומר אמת עכ''ל ה''ר מנוח:",
      "jbo:interprets": "jbr:text-mishnetorah-2-1-1-7",
      "jbo:book": "jbr:book-kesefmishne",
      "rdfs:label": "כסף משנה הלכות קריאת שמע א ז"
    },
    {
      "jbo:within": [
        "jbr:section-mishnetorah-2",
        "jbr:section-mishnetorah-2-1-1"
      ],
      "uri": "jbr:text-mishnetorah-lechemmishne-2-1-1-7",
      "jbo:position": "13",
      "jbo:text": "לחם משנה  מקום שהתקינו לחתום וכו'. שם משנה: %וכל שאינו אומר אמת ויציב% וכו'. סוף פ''ק (דף י\"ב.) %אמר רבה בר חנינא סבא משמיה דרב כל מי שלא אמר% וכו':",
      "jbo:interprets": "jbr:text-mishnetorah-2-1-1-7",
      "jbo:book": "jbr:book-lechemmishne",
      "rdfs:label": "לחם משנה הלכות קריאת שמע א ז"
    },
    {
      "jbo:within": [
        "jbr:section-mishnetorah-2",
        "jbr:section-mishnetorah-2-1-1"
      ],
      "uri": "jbr:text-mishnetorah-kesefmishne-2-1-1-8",
      "jbo:position": "14",
      "jbo:text": "כסף משנה  הקדים ברכה שנייה וכו'. שם [י''א:] %תנן התם א''ל הממונה ברכו ברכה אחת מאי היא א''ר זריקא א''ר אמי אר''ל יוצר אור ואמרו שם דהא דרבי זריקא לאו בפי' איתמר אלא מכללא איתמר דאמר רבי זריקא א''ר אמי אר''ל זאת אומרת ברכות אין מעכבות זו את זו% כלומר אא''ב יוצר אור הוו אמרי היינו דאין מעכבות זו את זו דלא הוו אמרי אהבה רבה אא''א אהבה רבה הוו אמרי דילמא הא דלא אמרי יוצר אור משום דלא מטא זמן יוצר אור וכי מטא זמניה הוו אמרי ליה ואי מכללא מאי כלומר מאי גריעותיה מאילו איתמר בפירוש ומהדר דאי מכללא לעולם אהבה רבה הוו אמרי וכי מטא זמן יוצר אור הוו אמרי ליה ומאי ברכות אין מעכבות זו את זו סדר ברכות. משמע מהכא דכיון דקי''ל דברכות אין מעכבות זו את זו מכ''ש שאין סדר לברכות ומ''מ יש לתמוה דכיון דקי''ל כל ברכה שאין בה שם ומלכות אינה ברכה וברכה הסמוכה לחבירתה אין בפתיחתה הזכרת השם ובכולה ליכא מלכות כשקורא אותה בלא סמוכה לחבירתה היאך יצא וצריך לומר דכיון שהיא סמוכה לחבירתה שיש בה שם ומלכות כשקורא אותה בפני עצמה נמי חשיבא כאילו יש בה שם ומלכות: בשחרית פתח יוצר אור וכו' עד אחר חתימתן. בסוף פרק קמא דברכות (שם י\"ב.) גרסינן %פשיטא היכא דנקיט כסא דחמרא בידיה וקסבר דשיכרא הוא ופתח ומברך אדעתא דשיכרא ומסיים אדעתא דחמרא יצא דאי נמי סיים בדשיכרא יצא דהא תנן על כולם אם אמר שהכל נהיה בדברו יצא אלא היכא דנקיט כסא דשיכרא בידיה וקסבר דחמרא הוא פתח ובריך אדעתא דחמרא וסיים בדשיכרא מאי בתר עיקר ברכה אזלינן או בתר חתימה אזלינן ת''ש שחרית פתח ביוצר אור וסיים במעריב ערבים לא יצא פתח במעריב ערבים וסיים ביוצר אור יצא ערבית פתח במעריב ערבים וסיים ביוצר אור לא יצא פתח ביוצר אור וסיים במעריב ערבים יצא כללו של דבר הכל הולך אחר החיתום שאני התם דקאמר ברוך יוצר המאורות. הניחא לרב דאמר כל ברכה שאין בה הזכרת השם אינה ברכה שפיר אלא לרבי יוחנן דאמר כל ברכה שאין בה מלכות אינה ברכה מאי איכא למימר אלא כיון דאמר רבה בר עולא כדי להזכיר מדת יום בלילה ומדת לילה ביום כי קאמר ברכה ומלכות מעיקרא אתרוייהו קאמר% עכ''ל הגמרא. ורבינו כתב בפ''ח מהלכות ברכות לקח כוס של שכר בידו והתחיל הברכה על מנת לומר שהכל וטעה ואמר בורא פרי הגפן אין מחזירין אותו וכן אם היה לפניו תבשיל של דגן ופתח על מנת לומר בורא מיני מזונות וטעה ואמר המוציא יצא מפני שבשעה שהזכיר שם ומלכות שהם עיקר הברכה לא נתכוון אלא לברכה הראויה לאותו המין והואיל ולא היה בעיקר הברכה טעות אע''פ שטעה בסופה יצא ואין מחזירין אותו עכ''ל. וכתבו תלמידי ה''ר יונה שרבינו מפרש פתח בדשיכרא וסיים בדחמרא ר''ל שגמר כל הברכה כמו אם היה שכר ואח''כ סיים ואמר בפה''ג קודם שישתה כגון שאמר בא''י אמ''ה שהכל נהיה בדברו ובורא פרי הגפן יצא כיון שסיים כראוי ואפילו סיים בדשיכרא כלומר ששתה מיד אחר שאמר שהנ''ב ונמצא שהיה הסיום כמו בשכר יצא אלא היכא דנקיט כסא דשיכרא וקסבר דחמרא פתח בדחמרא וסיים בדשיכרא כגון שאמר בא''י אמ''ה בפה''ג ושהנ''ב מאי בתר פתיחה אזלינן כלומר אחר מה שאמר בתחלה בורא פרי הגפן ולא יצא או אחר מה שאמר בסוף שהנ''ב ויצא ולא איפשטא ולקולא ואידך ברייתא בשחרית פתח ביוצר אור מפרש אותה שהתחיל בא''י יוצר אור ובשעת החתימה במקום בא''י יוצר המאורות חתם בא''י המעריב ערבים וכן כולה על זה הדרך. ויש קושיא לדרך הזה דבגמרא חזינן דמדמי הני ברייתות אהדדי ולזה הפירוש אינן דומות דחיתום האמור כאן הו''ל חיתום מדבר אחד בלבד או מיוצר המאורות או ממעריב ערבים וחיתום האמור למעלה הוא שבסוף אמר מענין אחר ובאותה חתימה עצמה אמר מתחילה מענין אחר ונמצא שבין בא''י ובין החתימה עצמה מפסיק עכ''ל. וכיוצא בזה פי' ה''ר מנוח שכתב וז''ל פתח ביוצר אור כגון שאמר בא''י יוצר אור אשר בדברו מעריב ערבים וכו' עד שחתם המעריב ערבים לא יצא שהרי החיתום היה שלא כראוי פתח במעריב ערבים כגון שאמר בא''י אמ''ה אשר בדברו מעריב ערבים יוצר אור ובורא חשך וכו' עד בא''י יוצר המאורות יצא שהרי חתם כהלכתו וכן בערבית וכו' מתפרש על זה הדרך שכל הברכות הולכות אחר חתימתן וכיון שחתם כהוגן אע''פ שפתח שלא כהוגן יצא עכ''ל. ותמהני איך עלה בדעתו לפרש כן בדברי רבינו שהרי דבר מבואר הוא שלשון רבינו אינו סובל פירוש זה בשום פנים שרבינו תלה הדבר שבשעה שזכר שם ומלכות לא נתכוון אלא לברכה הראויה. ולפי דעתם כיון שסיים בברכה הראויה אע''פ שפתח בברכה שאינה ראויה יצא אף ע''פ שמסתמא בשעת הזכרת שם ומלכות היתה כוונתו לברכה שאינה ראויה כמו שפתח וזה היפך דברי רבינו. ולי נראה שרבינו מפרש פתח ומברך אדעתא דשיכרא כלומר בשעת הזכרת שם ומלכות הוה אדעתא דשיכרא ואח''כ נזכר שהוא יין וסיים בפה''ג פשיטא דיצא דהא אפילו סיים כל הברכה כדעת פתיחתה ואמר שהכל יצא אלא כי קא מיבעיא לן פתח אדעתא דחמרא כלומר בשעת הזכרת שם ומלכות הוה אדעתא דחמרא ואחר כך נזכר שהוא שכר ובירך שהכל נהיה בדברו מאי בתר עיקר ברכה דהיינו שם ומלכות אזלינן והוי כאילו סיים ביין ואין ברכת היין פוטרת את השכר או דילמא בתר חתימה אזלינן ויצא ת''ש שחרית פתח ביוצר אור כלומר בשעת הזכרת שם ומלכות הוה אדעתא דליברך יוצר אור ואח''כ שכח ובמקום יוצר אור אמר אשר בדברו מעריב ערבים לא יצא פתח בשעת הזכרת שם ומלכות אדעתא למימר מעריב ערבים ואח''כ נזכר וסיים יוצר אור יצא ערבית פתח אשר בדברו אדעתא למימר מעריב ערבים ואח''כ שכח וסיים יוצר אור לא יצא פתח בשעת הזכרת שם ומלכות אדעתא למימר יוצר אור ואח''כ נזכר וסיים אשר בדברו מעריב ערבים יצא הא קמן דלא אזלינן בתר עיקר ברכה אלא בתר סיומא והא מיפשטא בעיין דבתר סיומא אזלינן ויצא. ודחי לעולם אימא לך דלא יצא דבתר עיקר ברכה אזלינן ותדע מ''ט כי פתח שחרית בעת הזכרת שם ומלכות אדעתא דמעריב ערבים ואח''כ נזכר וסיים יוצר אור יצא משום דמסתמא סירכיה בתרא נקט ואזיל וחתם יוצר המאורות והו''ל לר''י אליבא דרבה בר עולא פותח וחותם ביוצר וכן כי אמרינן ערבית פתח בשעת הזכרת שם ומלכות אדעתא דמעריב ערבים ואח''כ שכח וסיים יוצר אור לא יצא משום דמסתמא סירכיה בתרא נקט וחתם יוצר המאורות וה''ה נמי דכי קאמר שחרית פתח בשעת הזכרת שם ומלכות אדעתא דיוצר אור ואחר כך שכח וסיים אשר בדברו מעריב ערבים היינו טעמא דלא יצא משום דמסתמא סירכיה בתרא נקט וחתם בא''י המעריב ערבים. וכן כי קאמר ערבית פתח בשעת הזכרת שם ומלכות אדעתא דיוצר אור ואח''כ נזכר וסיים אשר בדברו מעריב ערבים היינו טעמא דיצא משום דמסתמא סירכיה בתרא נקט וחתם בא''י המעריב ערבים. וה''מ למימר שאני התם דקאמר בא''י המעריב ערבים אלא נקט בבא קמייתא דקתני בה יצא דהיינו שחרית פתח במעריב ערבים וסיים ביוצר אור יצא ותדע למה יצא לאו משום דבתר סיומא אזלינן דלעולם בתר עיקר ברכה אזלינן אלא היינו טעמא לפי שחתם יוצר המאורות אבל גבי בעיין דליכא תו חתימה ודאי בתר עיקר ברכה אזלינן דטעמא דמסתבר הוא החילוק הזה שאמרו שאני התם דאמר יוצר המאורות ומשום הכי יצא ולפיכך העתיק כאן לשון הברייתא. ומ''ש שכל הברכות הולכות אחר חתימתן ה''ק שכל ברכות שהן כגון אלו שיש חתימה בסופן ואע''פ שאין בסופן מלכות כיון שהפתיחה מעין החתימה כי קאמר ברכה ומלכות מעיקרא אתרוייהו קאמר אבל שאר ברכות שאין בהם שני תנאים אלו בתר עיקר ברכה אזלינן ואמרינן בגמרא דהאי שכל הברכות הולכות אחר החיתום אתא לאתויי אכל תמרי וקסבר נהמא אכל דאע''ג דפתח בעת הזכרת שם ומלכות אדעתא דנהמא וסיים בתמרי יצא מ''ט תמרי נמי מיזן זייני. ורבינו בפ''ח מהלכות ברכות כתב שאם לקח כוס של שכר בידו ונתכוון בשם ומלכות לברך שהכל וטעה ואמר בורא פרי הגפן יצא וממילא נפיק מאי דאיבעיא לן בגמרא כי נקיט כסא דשיכרא ופתח בדחמרא וסיים בדשיכרא שכיון שטעה בעיקר הברכה שלא יצא. ולכן כתב רבינו חלוקה זו ולא כתב חלוקה הנזכרת בגמרא זה נ''ל דרך נכון לדעת רבינו. וכבר עלה בדעתי לפרש דלרבינו ברייתא דפתח ביוצר אור וכו' היינו שהתחיל ממש יוצר אור וחתם בא''י המעריב ערבים ומייתי דאפילו הזכיר הטעות בפיו בתר חתימה אזלינן כל שכן גבי בעיין שלא הזכיר הטעות בפיו אלא בכוונה דלא אזלינן בתר עיקר ברכה ודחי דשאני התם שחותם בסוף יוצר המאורות או מעריב ערבים ומשום הכי יצא ולא אזלינן בתר עיקר ברכה כיון דאיכא חתימה בברכה כראוי אבל גבי בעיין דליכא חתימה בסוף לעולם בתר עיקר ברכה אזלינן ודחיתיו מלשון הברייתא פתח במעריב ערבים וסיים ביוצר אור יצא ואם איתא וסיים ביוצר המאורות מיבעי ליה ומ''מ דרך אפשר הוא ונימא דיוצר אור לאו דוקא. ומדקדוק דברי רבינו נראה שכך היה גורס פשיטא נקט כסא דחמרא בידיה פתח ובריך אדעתא דחמרא וסיים בדשיכרא יצא דא''נ פתח בדשיכרא יצא אלא נקיט כסא דשיכרא בידיה פתח ובריך אדעתא דשיכרא וסיים בדחמרא מאי ואע''פ שאין זה מעלה ומוריד לענין הבנת דברי רבינו כתבתיו לשלמות המלאכה: ודע שעל מה שכתב רבינו פרק ח' מהלכות ברכות כתב הראב''ד ז''ל כל מה שכתב באלו הענינים הכל הבל שאין הולכים אלא על הפירוש שהוציא בפיו עכ''ל. דעתו ז''ל שאין הברכה תלויה בכוונה אלא הכל תלוי במה שמוציא מפיו וכמבואר בפסקי הרא''ש ז''ל והסוגיא יפרשנה כשיטת הרי''ף ז''ל דהיינו אי אזלינן בתר מה שהוציא תחילה בפיו או אחר מה שהוציא בסוף אבל אם נלך אחר כוונת לבו או אחר מה שהוציא בפיו בהא לא אסתפק להו דפשיטא דדברים שבלב אינן דברים ולשון ההשגה הכי דייק שכתב שאין הולכים אלא על הפירוש שהוציא בפיו. ובעל מ''ע שרצה להכריע סברת רבינו מדמקשה תלמודא בפשיטות הניחא למ''ד וכו' אינו הכרע דלפום דדחי ליה שאני התם דקאמר יוצר המאורות א''ל תינח האי דיחויא לרב אלא לר''י מאי איכא למימר אבל טעם רבינו למפסק דבתר עיקר ברכה אזלינן אפילו לקולא כבר כתבתי דהיינו משום דמסתבר טעמא דההוא שינויא דאמרו שאני התם דקאמר יוצר המאורות: וראיתי שאלה אחת ששאלו חכמי לוני''ל לרבינו על זה הלשון והיא בעיני קשה עד מאד וז''ל השאלה. יורנו רבינו ואם שכר שעורים איך יצא ומרנא ורבנא אלפס ז''ל הולך על זה הדרך וחתרנו להוציא להיבשה ולא יכלנו שהרי פירות השכר אינן יוצאים מהגפן ודמי לפתח במעריב ערבים וסיים ביוצר אור לא יצא הראנו אתה רבינו את האור כי טוב: תשובה יראה לי שאין הדברים אמורים אלא בשכר היוצא מן הגפן כמו בנזיר מיין ושכר יזיר ובאותו שכר של ענבים שאין אדם רואה בכוס אם שכר אם יין ושיבא אדם לטעות ויפתח ע''מ שהוא שכר ויסיים בפה''ג אבל בשכר של שעורים וכיוצא בו לא איירי רבנן בדבר זה כלל וכי יש מי שיאמר לקח תמרא ופתח על דעת לברך ב''פ העץ וסיים המוציא לחם מן הארץ יצא אטו בשופטני עסקינן ומה מקום לשגגה זו אלא בשכר היוצא מן הגפן הן הדברים אמורים עכ''ל. וקשה שאיך אמרו שהרי''ף הולך על זה הדרך שאם נתכוונו על שפירש שכר זה היינו שכר של שעורים זאת לא ראינו ולא שמענו מדבריו ואם נתכוונו על שהרי''ף פסק לקולא ואין מחזירין אותו ובחלוקה זו שכתב רבינו יצא הושוו. דבה''ג שכתב רבינו מי הגיד להם שהרי''ף סובר כמותו דילמא לעולם אימא לך שלא יצא לדעת הרי''ף דדברים שבלב אינם דברים. ועוד קשה שאמרו שהרי פירות השכר אינן יוצאים מן הגפן ודמי לפתח במעריב ערבים וסיים ביוצר אור לא יצא דלא דמו דשאני התם דקאמר יוצר המאורות. ועוד שנראה מדבריהם דדוקא בשכר היוצא מן הגפן הדברים אמורים משום דכשאומר בפה''ג קושטא קאמר וא''כ אמאי לא איפשיטא בעיין כי היכי דפשיטא לן היכא דנקט כסא דחמרא וכו' משום דעל כולם אם אמר שהכל יצא הא נמי פשיטא משום דאפילו אמר בפה''ג יצא. גם תשובת רבינו אליהם אינה מתיישבת כלל שאם נתכוון להשיב דדוקא בשכר היוצא מן הגפן עסקינן משום דכי אמר נמי בורא פרי הגפן יצא אבל אם היה שכר שעורים לא יצא. וכן נראה מלשון רבינו ירוחם ז''ל שזהו פי' תשובה זו ואם הדבר כן קשה הקושיות שהקשיתי ועוד קשה למה נדחק לומר דלא איירי בשכר שעורים הרי כתב שאם היו לפניו פירות הארץ והתחיל הברכה על מנת לומר בורא פרי האדמה וטעה ואמר בורא פרי העץ אין מחזירין אותו ואם לקח שכר שעורים והתחיל הברכה על מנת לומר שהכל נהיה בדברו וטעה ואמר בורא פרי הגפן הא ודאי שאין מחזירין אותו דמאי שנא הא מהא. ואם כוונת רבינו בתשובתו נתכוון לתת מציאות איך אפשר שיטעה בין שהכל נהיה בדברו לבורא פרי הגפן וכמו שכתב אטו בשופטני עסקינן ולפי שהם שאלוהו ואם שכר שעורים היאך יצא השיבם דאין הדברים אמורים אלא בשכר גפנים אבל בשכר שעורים אין מקום לטעות אבל אם היה אפשר לטעות אה''נ דה''ה ודומה לפירות הארץ שכתב בסמוך. מ''מ יקשה שמה שטענוהו לא הודה להם ומה שהודה להם לא טענוהו שזה דבר עקרי בשאלתם ועל עיקרה הו''ל להשיב ולומר לא כמו שאתם סוברים שאני מפרש ההלכה כדעת הרי''ף כי שטה אחרת יש לי ולבאר להם מאי זה טעם פסק דבתר עיקר ברכה אזלינן גם לומר להם דלא דמי לפתח במעריב ערבים וסיים ביוצר אור לא יצא ולהניח המקרה ההוא אי עביד איניש דטעי או לא דאטו בין יום ללילה עביד איניש דטעי וכדתניא פתח ביוצר וכו' בין שכר שעורים ליין לא כ''ש ועוד שכמה יינות יש שהם לבנים או צהובים כשכר שעורים וא''כ אין מקום לתשובה זו: מצאתי להרמ''ך שכתב בדוחק גדול אתי פירוש ההלכה לפסק שלו מ''מ מה שהשיב הוא על זה ומוקי ההלכה בשכר של ענבים אינו כלום עכ''ל: והר''ש ן' וירגה נר''ו כתב וז''ל כדי להבין תשובה זו צ''ל שגירסת הרמב''ם בהלכה היא פשיטא היכא דנקט כסא דחמרא בידיה וידע דחמרא הוא ופתח אדעתא דחמרא וסיים בדשיכרא יצא דתנן על הכל אם אמר שהנ''ב יצא אלא היכא דנקיט כסא דשיכרא בידיה וידע דשיכרא הוא ופתח בדשיכרא וסיים בדחמרא מאי בתר ברכה אזלינן או בתר חיתום ועל זה שאלו חכמי לוני''ל להרמב''ם יען היתה זאת גירסתם בספרים שאלו ממנו אם השכר הוא של שעורים איך יעלה על הדעת שיצא בברכת בורא פרי הגפן ועל זה אמרו שחתרו למצוא דרך ליישב דברים אלו של הרי''ף ולא מצאו שהרי זה דומה לפתח בערבית במעריב ערבים וסיים ביוצר אור שלא יצא וה''נ איך יצא בבורא פה''ג על שכר שעורים. וע''ז השיב הרמב''ם שהשכר הוא של גפן כי אם הוא של שעורים לא יעלה על הדעת וכו'. ולפי גירסא זו שאנו אומרים שהיא גירסת הרמב''ם נמצאת החלוקה שהביא הרמב''ם היא החלוקה שעליה נתייסדה בעיית הגמרא עכ''ל. ודבר קשה הוא לומר שהיה לרבינו גירסא שלא נמצאת בספרים וגם יקשה עליו קושיות שהקשיתי לעיל ולכן אני אומר כי השאלה הזו גם תשובתה דבריהם סתומים וחתומים מ''מ לענין דברי רבינו בחיבור נ''ל שמה שכתבתי הוא דבר נכון. וכתבתי כל הדברים האלה במקום הזה לפי שהגמרא הביאה שני הענינים יחד הא דפתח ביוצר אור וכו' והא דפתח בדשיכרא גם אני בעניי ראיתי לכתבם יחד כדי שיתברר הדבר יותר. ובמה שכתב רבינו כאן דשחרית פתח ביוצר אור וכו' למדנו מה פירושו על פי הדרכים שכתבתי למעלה:",
      "jbo:interprets": "jbr:text-mishnetorah-2-1-1-8",
      "jbo:book": "jbr:book-kesefmishne",
      "rdfs:label": "כסף משנה הלכות קריאת שמע א ח"
    },
    {
      "jbo:within": [
        "jbr:section-mishnetorah-2",
        "jbr:section-mishnetorah-2-1-1"
      ],
      "uri": "jbr:text-mishnetorah-lechemmishne-2-1-1-8",
      "jbo:position": "15",
      "jbo:text": "לחם משנה  הקדים ברכה וכו'. שם (דף י\"א:) %אמר רבי שמעון בן לקיש זאת אומרת ברכות אינן מעכבות וכו' וכי מטא זמן וכו' ומאי ברכות אינם מעכבות [זו את זו] סדר ברכות [אינם מעכבות]% וכן פסק רבינו ז''ל: בשחרית פתח וכו'. ברייתא שם (דף י\"ב.) %והכי פירושה שאמר בשחר ברוך אתה ה' אלהינו מלך העולם יוצר אור וסיים בסוף במקום יוצר המאורות ברוך אתה ה' המעריב ערבים.% ורש''י ז''ל אינו מפרש כן והוא נמשך לפירוש שפירש במה שאמר לעיל מיניה פשיטא היכא דנקט כסא וכו' אבל רבינו פירשה בענין אחר לקמן בהלכו' ברכות ולפירושו פירוש הברייתא הזאת כמו שכתבתי:",
      "jbo:interprets": "jbr:text-mishnetorah-2-1-1-8",
      "jbo:book": "jbr:book-lechemmishne",
      "rdfs:label": "לחם משנה הלכות קריאת שמע א ח"
    },
    {
      "jbo:within": [
        "jbr:section-mishnetorah-2",
        "jbr:section-mishnetorah-2-1-1"
      ],
      "uri": "jbr:text-mishnetorah-kesefmishne-2-1-1-9",
      "jbo:position": "16",
      "jbo:text": "כסף משנה  איזהו זמן קריאת שמע בלילה. משנה שם (ברכות ב'.) %מאימתי קורין את שמע בערבין משעה שהכהנים נכנסים לאכול בתרומתן% ומפרש בגמרא %דהיינו משעת צאת הכוכבים% ונחלקו שם באותה משנה עד אימתי סוף זמנה ופסק כחכמים שאמרו עד חצות ואמרו בגמרא [שם ד] %דחכמים ס''ל דזמנה עד שיעלה עמוד השחר אלא שאמרו עד חצות כדי להרחיק את האדם מן העבירה שלא יאמר אוכל ואשתה ואחר כך אקרא קריאת שמע וחוטפתו שינה ונמצא ישן כל הלילה.% וז''ש רבינו כדי להרחיק את האדם מן הפשיעה דפשיעה היא לאכול ולשתות קודם קריאת שמע ואחר חצות נהי דיצא י''ח קריאת שמע בזמנה מ''מ הרי עבר על דברי חכמים וכדי שלא לעבור על דבריהם יהיה זהיר לקרותה מיד אחר יציאת הכוכבים קודם שיאכל וישתה:",
      "jbo:interprets": "jbr:text-mishnetorah-2-1-1-9",
      "jbo:book": "jbr:book-kesefmishne",
      "rdfs:label": "כסף משנה הלכות קריאת שמע א ט"
    },
    {
      "jbo:within": [
        "jbr:section-mishnetorah-2",
        "jbr:section-mishnetorah-2-1-1"
      ],
      "uri": "jbr:text-mishnetorah-lechemmishne-2-1-1-9",
      "jbo:position": "17",
      "jbo:text": "לחם משנה  איזהו זמן קריאת שמע וכו'. ריש פ''ק דברכות א''כ %למה אמרו עד חצות כדי להרחיק את האדם מן העבירה:%",
      "jbo:interprets": "jbr:text-mishnetorah-2-1-1-9",
      "jbo:book": "jbr:book-lechemmishne",
      "rdfs:label": "לחם משנה הלכות קריאת שמע א ט"
    },
    {
      "jbo:within": [
        "jbr:section-mishnetorah-2",
        "jbr:section-mishnetorah-2-1-1"
      ],
      "uri": "jbr:text-mishnetorah-kesefmishne-2-1-1-10",
      "jbo:position": "18",
      "jbo:text": "כסף משנה  הקורא קריאת שמע של ערבית וכו'. שם (ח':) %ברייתא דרשב''י פעמים שאדם קורא ק''ש שתי פעמים ביום אחת קודם הנץ החמה ואחת אחר הנץ החמה ויוצא בהם ידי חובתו אחת של יום וא' של לילה ושם% (ט'.) %אמר רבי אחא בר חנינא אמר ריב''ל הלכה כרשב''י א''ר זירא ובלבד שלא יאמר השכיבנו כי אתא רב יצחק בר יוסף אמר הא דרבי אחא בר חנינא לאו בפירוש איתמר אלא מכללא איתמר דההוא זוגא דרבנן דאשתכור בהילולא דבריה דריב''ל אמר כדאי הוא ר''ש לסמוך עליו בשעת הדחק.% וסובר רבינו דרשב''י לא פליג אדרבנן שאמרו דזמנה עד שיעלה עמוד השחר אלא דכי אמרו זמנה עד שיעלה עמוד השחר היינו אפילו עבר במזיד ואיחר מלקרוא קריאת שמע כל הלילה אם רצה לקרות קודם שיעלה עמוד השחר קורא ויוצא י''ח אבל אחר שעלה עמוד השחר כיון שעבר ולא קרא במזיד אפילו אם קרא אחר כך לא יצא ידי חובתו והיינו דרבנן דאמרי שאין זמנה אלא עד שיעלה עמוד השחר אבל מי שלא הזיד אלא היה אנוס קורא אפילו אחר שיעלה עמוד השחר קודם הנץ החמה ויוצא ידי חובתו והיינו דרשב''י וכדרב יצחק בר יוסף דאמר דהא דפסק ריב''ל כוותיה היינו בשעת הדחק וכן פסקו הרי''ף והרא''ש ז''ל. ונ''ל טעמן של דברים שהתורה אמרה בשכבך בשעה שדרך בני אדם שוכבין מסרה הדבר לחכמים שיפרשו עד אימתי הוי זמן שכיבה והם פירשו דעיקר זמן שכיבה הוי עד שיעלה עמוד השחר ולפיכך זמן קריאה בזמן הזה שוה לכל אדם אפילו למזידין ולפי שאחר שעלה עמוד השחר קודם שתנץ החמה איכא אינשי דגנו בההיא שעתא אמרו דאכתי הוי זמן שכיבה לגבי אנוסין אבל למזידין אמרו דכיון דרוב בני אדם קמו באותה שעה לא מיקרי תו זמן שכיבה. ומפרש רבינו שמה שאמר רבי זירא ובלבד שלא יאמר השכיבנו לא קאי אלא אהא דרשב''י כפירש''י ולא אאידך ברייתא דרשב''י דקאי נמי קודם שיעלה עמוד השחר שאכתוב לקמן והיא שנויה אצל זו. ומה שלא אמר שלא יאמר מעריב ערבים משום דמזכירים מדת לילה ביום: וכתב ה''ר מנוח שיכול לומר הברכה רק שיחסר הפתיחה שלא יתחיל השכיבנו כן כתב הריא''ג. ואני אומר שיאמר השכימנו במקום השכיבנו ומיהו מלשון הגמרא משמע שלא יאמר הברכה כלל עכ''ל וכן כתב הרא''ש:",
      "jbo:interprets": "jbr:text-mishnetorah-2-1-1-10",
      "jbo:book": "jbr:book-kesefmishne",
      "rdfs:label": "כסף משנה הלכות קריאת שמע א י"
    },
    {
      "jbo:within": [
        "jbr:section-mishnetorah-2",
        "jbr:section-mishnetorah-2-1-1"
      ],
      "uri": "jbr:text-mishnetorah-lechemmishne-2-1-1-10",
      "jbo:position": "19",
      "jbo:text": "לחם משנה  הקורא קריאת שמע של ערבית. פרק קמא (דף ח:) %רבי שמעון בן יוחאי אומר וכו' פעמים שאדם קורא וכו'. ואמרו שם ההוא זוגא דרבנן דאשתכור בהילולא וכו' אתו לקמיה דרבי יהושע בן לוי אמר כדאי הוא רבי שמעון לסמוך עליו בשעת הדחק: ואנוס שקרא בעת הזה% וכו'. שם (דף ט.) %אמר רבי זירא ובלבד שלא יאמר השכיבנו% ומפרש רבינו דקאי אמאי דקאמר רבי שמעון קודם הנץ החמה וכן פירשו התוס' ורש''י ז''ל פירש בענין אחר:",
      "jbo:interprets": "jbr:text-mishnetorah-2-1-1-10",
      "jbo:book": "jbr:book-lechemmishne",
      "rdfs:label": "לחם משנה הלכות קריאת שמע א י"
    },
    {
      "jbo:within": [
        "jbr:section-mishnetorah-2",
        "jbr:section-mishnetorah-2-1-1"
      ],
      "uri": "jbr:text-mishnetorah-kesefmishne-2-1-1-11",
      "jbo:position": "20",
      "jbo:text": "כסף משנה  ואי זה הוא זמנה ביום וכו'. (שם ט':) %אמר אביי לקריאת שמע כותיקים דא''ר יוחנן ותיקים היו גומרין עם הנץ החמה תניא נמי הכי ותיקים היו גומרין אותה עם הנץ החמה כדי שיסמוך גאולה לתפילה ונמצא מתפלל ביום.% ודעת רבינו שתפלה מצותה מיד אחר הנץ וכדאמר התם רבי זירא מאי קרא דמצוה להתפלל עם הנץ החמה שנאמר ייראוך עם שמש. וזהו שכתב רבינו כדי שיגמור לקרות ולברך ברכה אחרונה עם הנץ החמה כלומר כדי שתיכף שתנץ החמה יתפלל ומה שאמרו ותיקים היו גומרין אותה היינו שגומרים אותה וברכותיה. ומ''ש רבינו ושיעור זה כמו שיעור שעה קודם שתעלה השמש יש לתמוה היאך כתב רבינו שזמן זה הוא שיעור שעה אחת שנראה שהוא זמן מועט משיעור שעה. ורבינו מהר''י אבוהב ז''ל כתב דלא קשיא שהנה עליית השמש דהרמב''ם ר''ל לאחר שיעלה גוף השמש כולו והנץ החמה הוא מיד כשיתחיל גוף השמש לעלות עכ''ל. ובנוסחא אחרת מצאתי במקום שיעור שעה אחת עישור שעה אחת והיא נוסחא אמיתית: ואם איחר וקרא. כלומר אפילו במזיד דהא זמן קימה הוא עד סוף ג' שעות וכרבי יהושע דאמר במתניתין (שם ט': י'.) דזמנה עד ג' שעות ואפסיקא בגמרא הלכתא כוותיה ומוכח בירושלמי דהיינו עד סוף ג' שעות ואף על גב דבריש פרק קמא דברכות (דף ג':) אמרינן רבי נתן ס''ל כרבי יהושע וכו' שית דליליא ותרתי דיממא תרי משמרות הויין הכי קאמר תרתי שלמות שדרך כל מלכים לישן דאילו בשעה שלישית קצתם קמים אחר חציה וקצתם סמוך לסופה וקצתם בסופה ממש:",
      "jbo:interprets": "jbr:text-mishnetorah-2-1-1-11",
      "jbo:book": "jbr:book-kesefmishne",
      "rdfs:label": "כסף משנה הלכות קריאת שמע א יא"
    },
    {
      "jbo:within": [
        "jbr:section-mishnetorah-2",
        "jbr:section-mishnetorah-2-1-1"
      ],
      "uri": "jbr:text-mishnetorah-lechemmishne-2-1-1-11",
      "jbo:position": "21",
      "jbo:text": "לחם משנה  ואיזה הוא זמנה וכו'. שם (דף ט' ע\"ב) %אמר אביי לתפלה כאחרים לק''ש כותיקין דא''ר יוחנן ותיקין היו גומרין אותה עם הנץ החמה%. ופירש רבינו לשון גמר שגומרין הברכות עם הנץ החמה ואתי לשון גמר כפשטיה אבל ר''ח פירש גומרין קורין שר''ל שקורין אותה מהנץ החמה עד שלש שעות כמו שהוזכר בפסקי הרא''ש ז''ל:",
      "jbo:interprets": "jbr:text-mishnetorah-2-1-1-11",
      "jbo:book": "jbr:book-lechemmishne",
      "rdfs:label": "לחם משנה הלכות קריאת שמע א יא"
    },
    {
      "jbo:within": [
        "jbr:section-mishnetorah-2",
        "jbr:section-mishnetorah-2-1-1"
      ],
      "uri": "jbr:text-mishnetorah-kesefmishne-2-1-1-12",
      "jbo:position": "22",
      "jbo:text": "כסף משנה  מי שהקדים וקרא וכו'. (שם ח':) %תניא רשב''י אומר פעמים שאדם קורא קריאת שמע ב' פעמים בלילה אחת קודם שיעלה עמוד השחר ואחת לאחר שיעלה עמוד השחר ויוצא ידי חובתו אחת של יום ואחת של לילה%, וכתב הרי''ף דהיינו דוקא בדיעבד א''נ בשעת הדחק כגון מי שהיה משכים לדרך כלומר ואם יהיה בדרך בשעת קריאת שמע יודע שלא יוכל לכוין לבו או לא ירצו להמתין לו לעמוד בפסוק ראשון ולכן רוצה לקרות עתה אבל אם אינה שעת הדחק לא יקרא לכתחלה וכך הם דברי רבינו: וכתב ה''ר מנוח הא דאמרינן פ' א''ל הממונה [ל''ז:] הקורא עם אנשי משמר לא יצא י''ח פי' דה''ק לא יצא י''ח ק''ש בעונתה אבל אינו צריך לחזור ולקרות א''נ התם במי שרגיל לקרות עמהם שלא במקום אונס וקנסוהו שלא יצא כדי שלא יהא רגיל בכך ואנשי משמר שאני שהיו טרודים בקרבנות והוי כשעת הדחק וכתב דכגון שהיה הולך לדרך הרשות חשיב שעת הדחק ועדיף לקרות כן משעלה עמוד השחר בכוונה מלקרות אחר כך בלא כוונה ואם יש בעיר קבורת מת או מילה וכן יום ערבה דמפשי ברחמי יכולים לקרות תיכף משעלה עמוד השחר עכ''ל:",
      "jbo:interprets": "jbr:text-mishnetorah-2-1-1-12",
      "jbo:book": "jbr:book-kesefmishne",
      "rdfs:label": "כסף משנה הלכות קריאת שמע א יב"
    },
    {
      "jbo:within": [
        "jbr:section-mishnetorah-2",
        "jbr:section-mishnetorah-2-1-1"
      ],
      "uri": "jbr:text-mishnetorah-kesefmishne-2-1-1-13",
      "jbo:position": "23",
      "jbo:text": "כסף משנה  הקורא אחר שלש שעות וכו'. משנה (שם ט':) %הקורא מכאן ואילך כלומר מג' שעות ואילך לא הפסיד כאדם שקורא בתורה% ובגמרא מאי לא הפסיד לא הפסיד הברכות וכיון שלא חילקו שם בין אנוס למזיד משמע דדוקא גבי לילה דשכיח שינה הוא דגזרו, גם רבינו לא ראה לחלק ביניהם וזהו שכתב לענין שאחר שלש שעות לא יצא ידי חובת קריאת שמע בעונתה אפילו היה אנוס ולענין שמברך לפניה ולאחריה אחר ג' שעות כתב אפילו איחר כלומר אפילו איחר במזיד וכתב הרא''ש ז''ל בשם רבינו האי גאון ז''ל דדוקא עד סוף שעה רביעית הוא דמברך לפניה ולאחריה שהוא זמן תפלה לרבי יהודה אבל מכאן ואילך הפסיד הברכות ואם בירך עובר על לא תשא. וה''ר מנוח כתב הקורא אחר שלש שעות וכו' פי' כל שאר היום עד הערב ודעת ר''ח דדוקא עד שעה רביעית אבל מרביעית ואילך הפסיד ואין כן דעת כל המפרשים ולישנא דמתני' הכי מוכחא הקורא מכאן ואילך ולא יהיב שיעורא משמע דכולי יומא קאמר עכ''ל. יש שואלים מ''ט בשכבך דרשינן כל זמן שבני אדם שוכבים על מטתם וכדאמרינן בהא דרשב''י פעמים שאדם קורא קריאת שמע ב' פעמים ביום אחת קודם הנץ החמה ואחת אחר הנץ החמה ויוצא י''ח אחת של יום ואחת של לילה ומסיק התם דקרי ליה ליליא משום דאיכא אינשי דגנו בההיא שעתא וע''כ אין פי' שבאותה שעה עולים על מטתם לשכב דאין דרך בני אדם לשכב באותה שעה אלא פי' שעדיין שוכבים על מטתם ואם כן בשכבך פי' בעודם שוכבים והיינו לרוב בני אדם עד שיעלה עמוד השחר ולמה לא דרשו כן ובקומך כל זמן שבני אדם קמים דהיינו כל היום. וי''ל דאה''נ דהכי דרשינן ליה ומ''ה אמרי' הקורא מכאן ואילך לא הפסיד הברכות ואילו לא היה זמן קריאת שמע כלל היו ברכותיו לבטלה אלא משום דקי''ל דצריך לסמוך גאולה לתפלה ותפלות כנגד התמידין תקנום והתמיד היה קרב עד ד' שעות ואם כן קודם צריך לקרות קריאת שמע ולכך הקדימו זמנה עד סוף שלש שעות ואסמכוה אקרא ובקומך בשעה שדרך בני אדם קמים ותדע דאסמכתא היא ולא עיקר פירושא דקרא דתלי טעמא עד סוף ג' שעות דשכן דרך בני מלכים לעמוד בשלש שעות ואטו בני מלכים מי הוו רובא דעלמא אלא ודאי כדאמרן כנ''ל:",
      "jbo:interprets": "jbr:text-mishnetorah-2-1-1-13",
      "jbo:book": "jbr:book-kesefmishne",
      "rdfs:label": "כסף משנה הלכות קריאת שמע א יג"
    },
    {
      "jbo:within": [
        "jbr:section-mishnetorah-2",
        "jbr:section-mishnetorah-2-1-1"
      ],
      "uri": "jbr:text-mishnetorah-lechemmishne-2-1-1-13",
      "jbo:position": "24",
      "jbo:text": "לחם משנה  הקורא אחר שלש שעות וכו'. משנה שם פרק קמא %רבי יהושע אומר עד שלש שעות וכו' הקורא מכאן ואילך לא הפסיד% וכו' ואמרו בגמרא (דף י' ע\"ב) %מאי לא הפסיד לא הפסיד הברכות:%",
      "jbo:interprets": "jbr:text-mishnetorah-2-1-1-13",
      "jbo:book": "jbr:book-lechemmishne",
      "rdfs:label": "לחם משנה הלכות קריאת שמע א יג"
    }
  ]
}