package apps.jbsmekorot;

import org.apache.lucene.document.Document;
import org.junit.*;
import spanthera.SpannedDocument;
import spanthera.manipulations.MergeSiblingSpans;
import spanthera.manipulations.RemoveTagsInContainedSpans;

import java.util.List;

/**
 * Created by omishali on 03/10/2017.
 */
public class JbsIndexShell {
    private JbsTanachIndex index;
    SpannedDocument doc;
    private String textOrchotTzadikim = "האמת. הנשמה נבראת ממקום רוח הקודש, שנאמר (בראשית ב ד): \"ויפח באפיו נשמת חיים\"; ונחצבה ממקום טהרה, ונבראת מזוהר העליון מכסא הכבוד. ואין למעלה במקום קודשי הקודשים שקר, אלא הכל אמת, שנאמר (ירמיהו י י): \"ויי אלהים אמת\". ומצאתי כי כתיב: \"אהיה אשר אהיה\" (שמות ג יד), וכתיב: \"ויי אלהים אמת, הוא אלהים חיים ומלך עולם\" (ירמיהו שם). ועתה יש להודיעך שהקדוש ברוך הוא אלהים אמת: כי תמצא עשרים ואחת פעמים \"אהיה\" שהוא בגימטריא \"אמת\", וגם כן \"אהיה\" בגימטריא עשרים ואחת.";
    private String textMidrashRabaEster_7_9 = "וירא המן כי אין מרדכי כרע ומשתחוה לו (אסתר ג, ה), אמר רבי איבו (תהלים סט, כד): תחשכנה עיניהם של רשעים מראות. לפי שמראית עיניהם של רשעים מורידות אותם לגיהנם, הדא הוא דכתיב (בראשית ו, ב): ויראו בני האלהים את בנות האדם. (בראשית ט, כב): וירא חם אבי כנען. (בראשית כח, ח): וירא עשו כי רעות בנות כנען. (במדבר כב, ב): וירא בלק בן צפור. (במדבר כד, א): וירא בלעם כי טוב בעיני ה' לברך את ישראל. וירא המן כי אין מרדכי כרע ומשתחוה לו. אבל מראית עיניהם של צדיקים תואר, לפי שמראית עיניהם של צדיקים מעלה אותם למעלה העליונה, הדא הוא דכתיב (בראשית יח, ב): וישא עיניו וירא והנה שלשה אנשים. (בראשית כב, יג): וירא והנה איל. (בראשית כט, ב): וירא והנה באר בשדה. (שמות ג, ב): וירא והנה הסנה. (במדבר כה, ז): וירא פינחס, לפיכך הם שמחים במראית עיניהם, שנאמר (תהלים קז, מב): יראו ישרים וישמחו.";
    private String textRashi_1_6_9 = "רש\"י אלה תולדת נח נח איש צדיק. הואיל והזכירו, סיפר בשבחו, (א) שנאמר זכר צדיק לברכה (משלי י, ז.). דבר אחר, ללמדך שעיקר תולדותיהם (ב) של צדיקים מעשים טובים בדורותיו. יש מרבותינו דורשים אותו לשבח, כל שכן שאילו היה בדור צדיקים היה צדיק יותר, ויש שדורשים אותו לגנאי, (ג) לפי דורו היה צדיק, ואילו היה בדורו של אברהם לא היה נחשב לכלום (סנהדרין קח.): את האלהים התהלך נח. ובאברהם (ד) הוא אומר אשר התהלכתי לפניו (בראשית כד, מ.), נח היה צריך סעד לתומכו, אבל אברהם היה מתחזק ומהלך בצדקו מאליו: התהלך. לשון עבר, (ה) וזהו שמושו של ל' בלשון (ו) כבד משמשת להבא ולשעבר בלשון אחד, קום התהלך (שם יג, יז.), להבא. התהלך נח, לשעבר. התפלל בעד עבדיך (שמואל-א יב, יט.), להבא. ובא והתפלל אל הבית הזה (מלכים-א ח, מב.), לשון עבר, אלא שהוי\"ו שבראשו (ז) הופכו להבא:";
    private String textMitzva_1_1 = "היא הצווי אשר צונו בהאמנת האלהות, והוא שנאמין שיש שם עלה וסבה הוא פועל לכל הנמצאים, והוא אמרו (שמות כ-ב) ''אנכי ה' אלהיך''. ובסוף גמרא מכות (גמרא מכות כג-ב) אמרו תרי''ג מצות נאמרו למשה בסיני, מאי קראה (דברים לג-ד) ''תורה צוה לנו משה'', ר''ל מנין תור''ה. והקשו על זה ואמרו תורת בגימטריא תרי''א הוי, והיה המענה אנכי ולא יהיה מפי הגבורה שמענום. הנה נתבאר לך שאנכי ה' מכלל תרי''ג מצות, והוא צווי באמונת האלהות כמו שבארנו.";
    private String textRaba_39_9 = "אמר רבי לוי שתי פעמים כתיב לך לך, ואין אנו יודעים אי זו חביבה אם השניה אם הראשונה, ממה דכתיב (בראשית כב, ב): אל ארץ המוריה, הוי השניה חביבה מן הראשונה. אמר רבי יוחנן לך לך מארצך, מארפכי שלך. וממולדתך, זו שכונתך. ומבית אביך, זו בית אביך. אל הארץ אשר אראך, ולמה לא גלה לו, כדי לחבבה בעיניו ולתן לו שכר על כל פסיעה ופסיעה, הוא דעתיה דרבי יוחנן, דאמר רבי יוחנן (בראשית כב, ב): ויאמר קח נא את בנך את יחידך, אמר לו זה יחיד לאמו וזה יחיד לאמו. אמר לו אשר אהבת, אמר לו ואית תחומין במעיא. אמר לו את יצחק, ולמה לא גלה לו, כדי לחבבו בעיניו ולתן לו שכר על כל דבור ודבור, דאמר רב הונא משם רבי אליעזר בנו של רבי יוסי הגלילי, משהה הקדוש ברוך הוא ומתלא עיניהם של צדיקים, ואחר כך הוא מגלה להם טעמו של דבר. כך אל הארץ אשר אראך. על אחד ההרים אשר אמר אליך. (יונה ג, ב): וקרא אליה את הקריאה אשר אני דבר אליך. (יחזקאל ג, כב): קום צא אל הבקעה ושם אדבר אותך.";


    @Before
    public void before() throws Exception {
        index = new JbsTanachIndex();
    }

    @Test
    public void getDocumentByURI() {
        List<Document> result = index.searchExactInUri("jbr:text-tanach-6-24-3");
        index.printDocs(result);
    }

    @Test
    public void getDocumentByText() {
        //List<Document> result = index.searchExactInText("בעיני יהוה");
        //System.out.println(result.size() + " results:");
        //index.printDocs(result);
    }

    @Test
    public void printSpannedDocument() {
        doc = new SpannedDocument(textRaba_39_9, PsukimTagger.MINIMAL_PASUK_LENGTH, PsukimTagger.MAXIMAL_PASUK_LENGTH);
        doc.add(new PsukimTagger()).tag();
        doc.add(new MergeSiblingSpans()).manipulate();
        doc.add(new RemoveTagsInContainedSpans()).manipulate();
        doc.add(new FilterTagsFromSpansSize3(doc)).manipulate();
        doc.add(new FilterTagsFromSpansSize2(doc)).manipulate();

        System.out.println(doc.toString());
    }


}
